package com.pg.dal.enumerate;

import java.util.List;

import com.google.common.collect.Lists;

public enum CityEnum {
	
	北京市2(1,2,"北京市"),

	天津市23(22,23,"天津市"),

	上海市45(44,45,"上海市"),

	重庆市67(66,67,"重庆市"),

	石家庄市109(108,109,"石家庄市"),

	张家口市145(108,145,"张家口市"),

	承德市176(108,176,"承德市"),

	秦皇岛市196(108,196,"秦皇岛市"),

	唐山市208(108,208,"唐山市"),

	廊坊市229(108,229,"廊坊市"),

	保定市246(108,246,"保定市"),

	衡水市290(108,290,"衡水市"),

	沧州市310(108,310,"沧州市"),

	邢台市337(108,337,"邢台市"),

	邯郸市372(108,372,"邯郸市"),

	太原市407(406,407,"太原市"),

	朔州市421(406,421,"朔州市"),

	大同市432(406,432,"大同市"),

	阳泉市451(406,451,"阳泉市"),

	长治市459(406,459,"长治市"),

	晋城市483(406,483,"晋城市"),

	忻州市494(406,494,"忻州市"),

	晋中市521(406,521,"晋中市"),

	临汾市542(406,542,"临汾市"),

	吕梁市574(406,574,"吕梁市"),

	运城市598(406,598,"运城市"),

	呼和浩特市623(622,623,"呼和浩特市"),

	包头市638(622,638,"包头市"),

	乌海市651(622,651,"乌海市"),

	赤峰市655(622,655,"赤峰市"),

	通辽市677(622,677,"通辽市"),

	呼伦贝尔市692(622,692,"呼伦贝尔市"),

	鄂尔多斯市713(622,713,"鄂尔多斯市"),

	乌兰察布市729(622,729,"乌兰察布市"),

	巴彦淖尔市750(622,750,"巴彦淖尔市"),

	兴安盟764(622,764,"兴安盟"),

	锡林郭勒盟775(622,775,"锡林郭勒盟"),

	阿拉善盟798(622,798,"阿拉善盟"),

	沈阳市805(804,805,"沈阳市"),

	朝阳市822(804,822,"朝阳市"),

	阜新市832(804,832,"阜新市"),

	铁岭市842(804,842,"铁岭市"),

	抚顺市853(804,853,"抚顺市"),

	本溪市864(804,864,"本溪市"),

	辽阳市873(804,873,"辽阳市"),

	鞍山市882(804,882,"鞍山市"),

	丹东市892(804,892,"丹东市"),

	大连市900(804,900,"大连市"),

	营口市912(804,912,"营口市"),

	盘锦市919(804,919,"盘锦市"),

	锦州市926(804,926,"锦州市"),

	葫芦岛市936(804,936,"葫芦岛市"),

	长春市946(945,946,"长春市"),

	白城市958(945,958,"白城市"),

	松原市966(945,966,"松原市"),

	吉林市976(945,976,"吉林市"),

	四平市987(945,987,"四平市"),

	辽源市996(945,996,"辽源市"),

	通化市1003(945,1003,"通化市"),

	白山市1014(945,1014,"白山市"),

	延边州1025(945,1025,"延边州"),

	哈尔滨市1037(1036,1037,"哈尔滨市"),

	齐齐哈尔市1064(1036,1064,"齐齐哈尔市"),

	七台河市1089(1036,1089,"七台河市"),

	黑河市1095(1036,1095,"黑河市"),

	大庆市1105(1036,1105,"大庆市"),

	鹤岗市1119(1036,1119,"鹤岗市"),

	伊春市1130(1036,1130,"伊春市"),

	佳木斯市1149(1036,1149,"佳木斯市"),

	双鸭山市1165(1036,1165,"双鸭山市"),

	鸡西市1178(1036,1178,"鸡西市"),

	牡丹江市1189(1036,1189,"牡丹江市"),

	绥化市1202(1036,1202,"绥化市"),

	大兴安岭地区1219(1036,1219,"大兴安岭地区"),

	南京市1227(1226,1227,"南京市"),

	徐州市1243(1226,1243,"徐州市"),

	连云港市1259(1226,1259,"连云港市"),

	宿迁市1271(1226,1271,"宿迁市"),

	淮安市1280(1226,1280,"淮安市"),

	盐城市1293(1226,1293,"盐城市"),

	扬州市1308(1226,1308,"扬州市"),

	泰州市1317(1226,1317,"泰州市"),

	南通市1324(1226,1324,"南通市"),

	镇江市1335(1226,1335,"镇江市"),

	常州市1342(1226,1342,"常州市"),

	无锡市1350(1226,1350,"无锡市"),

	苏州市1359(1226,1359,"苏州市"),

	杭州市1372(1371,1372,"杭州市"),

	湖州市1387(1371,1387,"湖州市"),

	嘉兴市1396(1371,1396,"嘉兴市"),

	舟山市1406(1371,1406,"舟山市"),

	宁波市1413(1371,1413,"宁波市"),

	绍兴市1425(1371,1425,"绍兴市"),

	衢州市1433(1371,1433,"衢州市"),

	金华市1442(1371,1442,"金华市"),

	台州市1453(1371,1453,"台州市"),

	温州市1465(1371,1465,"温州市"),

	丽水市1483(1371,1483,"丽水市"),

	合肥市1501(1500,1501,"合肥市"),

	宿州市1512(1500,1512,"宿州市"),

	淮北市1522(1500,1522,"淮北市"),

	亳州市1528(1500,1528,"亳州市"),

	阜阳市1536(1500,1536,"阜阳市"),

	蚌埠市1549(1500,1549,"蚌埠市"),

	淮南市1560(1500,1560,"淮南市"),

	滁州市1568(1500,1568,"滁州市"),

	马鞍山市1581(1500,1581,"马鞍山市"),

	芜湖市1587(1500,1587,"芜湖市"),

	铜陵市1598(1500,1598,"铜陵市"),

	安庆市1604(1500,1604,"安庆市"),

	黄山市1623(1500,1623,"黄山市"),

	六安市1635(1500,1635,"六安市"),

	巢湖市1648(1500,1648,"巢湖市"),

	池州市1658(1500,1658,"池州市"),

	宣城市1666(1500,1666,"宣城市"),

	福州市1680(1679,1680,"福州市"),

	南平市1699(1679,1699,"南平市"),

	莆田市1713(1679,1713,"莆田市"),

	三明市1719(1679,1719,"三明市"),

	泉州市1740(1679,1740,"泉州市"),

	厦门市1758(1679,1758,"厦门市"),

	漳州市1765(1679,1765,"漳州市"),

	龙岩市1785(1679,1785,"龙岩市"),

	宁德市1798(1679,1798,"宁德市"),

	南昌市1813(1812,1813,"南昌市"),

	九江市1827(1812,1827,"九江市"),

	景德镇市1849(1812,1849,"景德镇市"),

	鹰潭市1855(1812,1855,"鹰潭市"),

	新余市1860(1812,1860,"新余市"),

	萍乡市1864(1812,1864,"萍乡市"),

	赣州市1873(1812,1873,"赣州市"),

	上饶市1907(1812,1907,"上饶市"),

	抚州市1930(1812,1930,"抚州市"),

	宜春市1952(1812,1952,"宜春市"),

	吉安市1967(1812,1967,"吉安市"),

	济南市1993(1992,1993,"济南市"),

	青岛市2006(1992,2006,"青岛市"),

	聊城市2019(1992,2019,"聊城市"),

	德州市2029(1992,2029,"德州市"),

	东营市2047(1992,2047,"东营市"),

	淄博市2056(1992,2056,"淄博市"),

	潍坊市2068(1992,2068,"潍坊市"),

	烟台市2081(1992,2081,"烟台市"),

	威海市2095(1992,2095,"威海市"),

	日照市2100(1992,2100,"日照市"),

	临沂市2107(1992,2107,"临沂市"),

	枣庄市2129(1992,2129,"枣庄市"),

	济宁市2136(1992,2136,"济宁市"),

	泰安市2154(1992,2154,"泰安市"),

	莱芜市2163(1992,2163,"莱芜市"),

	滨州市2166(1992,2166,"滨州市"),

	菏泽市2179(1992,2179,"菏泽市"),

	郑州市2198(2197,2198,"郑州市"),

	开封市2212(2197,2212,"开封市"),

	三门峡市2228(2197,2228,"三门峡市"),

	洛阳市2238(2197,2238,"洛阳市"),

	焦作市2262(2197,2262,"焦作市"),

	新乡市2277(2197,2277,"新乡市"),

	鹤壁市2296(2197,2296,"鹤壁市"),

	安阳市2304(2197,2304,"安阳市"),

	濮阳市2318(2197,2318,"濮阳市"),

	商丘市2330(2197,2330,"商丘市"),

	许昌市2346(2197,2346,"许昌市"),

	漯河市2356(2197,2356,"漯河市"),

	平顶山市2364(2197,2364,"平顶山市"),

	南阳市2379(2197,2379,"南阳市"),

	信阳市2400(2197,2400,"信阳市"),

	周口市2417(2197,2417,"周口市"),

	驻马店市2436(2197,2436,"驻马店市"),

	济源市2455(2197,2455,"济源市"),

	武汉市2457(2456,2457,"武汉市"),

	十堰市2471(2456,2471,"十堰市"),

	襄樊市2485(2456,2485,"襄樊市"),

	荆门市2498(2456,2498,"荆门市"),

	孝感市2506(2456,2506,"孝感市"),

	黄冈市2517(2456,2517,"黄冈市"),

	鄂州市2535(2456,2535,"鄂州市"),

	黄石市2539(2456,2539,"黄石市"),

	咸宁市2547(2456,2547,"咸宁市"),

	荆州市2558(2456,2558,"荆州市"),

	宜昌市2570(2456,2570,"宜昌市"),

	随州市2589(2456,2589,"随州市"),

	省直辖县级行政单位2592(2456,2592,"省直辖县级行政单位"),

	恩施州2598(2456,2598,"恩施州"),

	长沙市2614(2613,2614,"长沙市"),

	张家界市2628(2613,2628,"张家界市"),

	常德市2635(2613,2635,"常德市"),

	益阳市2651(2613,2651,"益阳市"),

	岳阳市2661(2613,2661,"岳阳市"),

	株洲市2675(2613,2675,"株洲市"),

	湘潭市2689(2613,2689,"湘潭市"),

	衡阳市2696(2613,2696,"衡阳市"),

	郴州市2714(2613,2714,"郴州市"),

	永州市2734(2613,2734,"永州市"),

	邵阳市2755(2613,2755,"邵阳市"),

	怀化市2776(2613,2776,"怀化市"),

	娄底市2799(2613,2799,"娄底市"),

	湘西州2807(2613,2807,"湘西州"),

	广州市2823(2822,2823,"广州市"),

	深圳市2836(2822,2836,"深圳市"),

	清远市2843(2822,2843,"清远市"),

	韶关市2857(2822,2857,"韶关市"),

	河源市2872(2822,2872,"河源市"),

	梅州市2884(2822,2884,"梅州市"),

	潮州市2899(2822,2899,"潮州市"),

	汕头市2905(2822,2905,"汕头市"),

	揭阳市2914(2822,2914,"揭阳市"),

	汕尾市2923(2822,2923,"汕尾市"),

	惠州市2930(2822,2930,"惠州市"),

	东莞市2937(2822,2937,"东莞市"),

	深圳市2938(2822,2938,"深圳市"),

	珠海市2945(2822,2945,"珠海市"),

	中山市2949(2822,2949,"中山市"),

	江门市2950(2822,2950,"江门市"),

	佛山市2958(2822,2958,"佛山市"),

	肇庆市2964(2822,2964,"肇庆市"),

	云浮市2976(2822,2976,"云浮市"),

	阳江市2985(2822,2985,"阳江市"),

	茂名市2992(2822,2992,"茂名市"),

	湛江市3000(2822,3000,"湛江市"),

	南宁市3016(3015,3016,"南宁市"),

	桂林市3029(3015,3029,"桂林市"),

	柳州市3059(3015,3059,"柳州市"),

	梧州市3076(3015,3076,"梧州市"),

	贵港市3087(3015,3087,"贵港市"),

	玉林市3094(3015,3094,"玉林市"),

	钦州市3105(3015,3105,"钦州市"),

	北海市3112(3015,3112,"北海市"),

	防城港市3118(3015,3118,"防城港市"),

	崇左市3124(3015,3124,"崇左市"),

	百色市3137(3015,3137,"百色市"),

	河池市3161(3015,3161,"河池市"),

	来宾市3182(3015,3182,"来宾市"),

	贺州市3193(3015,3193,"贺州市"),

	海口市3202(3201,3202,"海口市"),

	三亚市3207(3201,3207,"三亚市"),

	省直辖行政单位3208(3201,3208,"省直辖行政单位"),

	成都市3236(3235,3236,"成都市"),

	广元市3261(3235,3261,"广元市"),

	绵阳市3273(3235,3273,"绵阳市"),

	德阳市3289(3235,3289,"德阳市"),

	南充市3298(3235,3298,"南充市"),

	广安市3313(3235,3313,"广安市"),

	遂宁市3322(3235,3322,"遂宁市"),

	内江市3331(3235,3331,"内江市"),

	乐山市3340(3235,3340,"乐山市"),

	自贡市3358(3235,3358,"自贡市"),

	泸州市3367(3235,3367,"泸州市"),

	宜宾市3379(3235,3379,"宜宾市"),

	攀枝花市3399(3235,3399,"攀枝花市"),

	巴中市3407(3235,3407,"巴中市"),

	达州市3415(3235,3415,"达州市"),

	资阳市3428(3235,3428,"资阳市"),

	眉山市3435(3235,3435,"眉山市"),

	雅安市3447(3235,3447,"雅安市"),

	阿坝州3463(3235,3463,"阿坝州"),

	甘孜州3490(3235,3490,"甘孜州"),

	凉山州3527(3235,3527,"凉山州"),

	贵阳市3562(3561,3562,"贵阳市"),

	六盘水市3576(3561,3576,"六盘水市"),

	遵义市3583(3561,3583,"遵义市"),

	安顺市3608(3561,3608,"安顺市"),

	毕节地区3620(3561,3620,"毕节地区"),

	铜仁地区3636(3561,3636,"铜仁地区"),

	黔东南州3656(3561,3656,"黔东南州"),

	黔南州3688(3561,3688,"黔南州"),

	黔西南州3711(3561,3711,"黔西南州"),

	昆明市3729(3728,3729,"昆明市"),

	曲靖市3752(3728,3752,"曲靖市"),

	玉溪市3769(3728,3769,"玉溪市"),

	保山市3787(3728,3787,"保山市"),

	昭通市3797(3728,3797,"昭通市"),

	丽江市3819(3728,3819,"丽江市"),

	思茅市3829(3728,3829,"思茅市"),

	临沧市3849(3728,3849,"临沧市"),

	德宏州3865(3728,3865,"德宏州"),

	怒江州3874(3728,3874,"怒江州"),

	迪庆州3884(3728,3884,"迪庆州"),

	大理州3891(3728,3891,"大理州"),

	楚雄州3915(3728,3915,"楚雄州"),

	红河州3935(3728,3935,"红河州"),

	文山州3960(3728,3960,"文山州"),

	西双版纳州3977(3728,3977,"西双版纳州"),

	拉萨市3984(3983,3984,"拉萨市"),

	那曲地区4000(3983,4000,"那曲地区"),

	昌都地区4021(3983,4021,"昌都地区"),

	林芝地区4044(3983,4044,"林芝地区"),

	山南地区4059(3983,4059,"山南地区"),

	日喀则地区4084(3983,4084,"日喀则地区"),

	阿里地区4120(3983,4120,"阿里地区"),

	西安市4137(4136,4137,"西安市"),

	延安市4155(4136,4155,"延安市"),

	铜川市4181(4136,4181,"铜川市"),

	渭南市4187(4136,4187,"渭南市"),

	咸阳市4207(4136,4207,"咸阳市"),

	宝鸡市4232(4136,4232,"宝鸡市"),

	汉中市4254(4136,4254,"汉中市"),

	榆林市4276(4136,4276,"榆林市"),

	安康市4300(4136,4300,"安康市"),

	商洛市4320(4136,4320,"商洛市"),

	兰州市4335(4334,4335,"兰州市"),

	嘉峪关市4347(4334,4347,"嘉峪关市"),

	白银市4352(4334,4352,"白银市"),

	天水市4361(4334,4361,"天水市"),

	武威市4374(4334,4374,"武威市"),

	酒泉市4382(4334,4382,"酒泉市"),

	张掖市4394(4334,4394,"张掖市"),

	庆阳市4406(4334,4406,"庆阳市"),

	平凉市4422(4334,4422,"平凉市"),

	定西市4436(4334,4436,"定西市"),

	陇南市4450(4334,4450,"陇南市"),

	临夏州4467(4334,4467,"临夏州"),

	甘南州4483(4334,4483,"甘南州"),

	西宁市4500(4499,4500,"西宁市"),

	海东地区4511(4499,4511,"海东地区"),

	海北州4524(4499,4524,"海北州"),

	海南州4533(4499,4533,"海南州"),

	黄南州4544(4499,4544,"黄南州"),

	果洛州4553(4499,4553,"果洛州"),

	玉树州4566(4499,4566,"玉树州"),

	海西州4579(4499,4579,"海西州"),

	银川市4589(4588,4589,"银川市"),

	石嘴山市4598(4588,4598,"石嘴山市"),

	吴忠市4603(4588,4603,"吴忠市"),

	固原市4610(4588,4610,"固原市"),

	中卫市4620(4588,4620,"中卫市"),

	乌鲁木齐市4625(4624,4625,"乌鲁木齐市"),

	克拉玛依市4635(4624,4635,"克拉玛依市"),

	自治区直辖县级行政单位4640(4624,4640,"自治区直辖县级行政单位"),

	喀什地区4645(4624,4645,"喀什地区"),

	阿克苏地区4669(4624,4669,"阿克苏地区"),

	和田地区4687(4624,4687,"和田地区"),

	吐鲁番地区4702(4624,4702,"吐鲁番地区"),

	哈密地区4708(4624,4708,"哈密地区"),

	克孜勒苏柯州4714(4624,4714,"克孜勒苏柯州"),

	博尔塔拉州4722(4624,4722,"博尔塔拉州"),

	昌吉州4728(4624,4728,"昌吉州"),

	巴音郭楞州4742(4624,4742,"巴音郭楞州"),

	伊犁州4760(4624,4760,"伊犁州"),

	塔城地区4779(4624,4779,"塔城地区"),

	阿勒泰地区4792(4624,4792,"阿勒泰地区"),

	香港特别行政区4803(4802,4803,"香港特别行政区"),

	澳门特别行政区4823(4822,4823,"澳门特别行政区"),

	台北4826(4825,4826,"台北"),

	高雄4827(4825,4827,"高雄"),

	台中4828(4825,4828,"台中"),

	花莲4829(4825,4829,"花莲"),

	基隆4830(4825,4830,"基隆"),

	嘉义4831(4825,4831,"嘉义"),

	金门4832(4825,4832,"金门"),

	连江4833(4825,4833,"连江"),

	苗栗4834(4825,4834,"苗栗"),

	南投4835(4825,4835,"南投"),

	澎湖4836(4825,4836,"澎湖"),

	屏东4837(4825,4837,"屏东"),

	台东4838(4825,4838,"台东"),

	台南4839(4825,4839,"台南"),

	桃园4840(4825,4840,"桃园"),

	新竹4841(4825,4841,"新竹"),

	宜兰4842(4825,4842,"宜兰"),

	云林4843(4825,4843,"云林"),

	彰化4844(4825,4844,"彰化");
	
	private int provinceCode;
	private int code;
	private String name;
	
	private CityEnum(int provinceCode, int code, String name){
		this.provinceCode = provinceCode;
		this.code = code;
		this.name = name;
	}

	public int getProvinceCode(){
		return provinceCode;
	}
	
	public int getCode() {
		return code;
	}

	public String getName() {
		return name;
	}
	
	public static List<CityEnum> getAll(){
		return Lists.newArrayList(CityEnum.values());
	}
	
	public static List<CityEnum> getByProvinceCode(int provinceCode){
		List<CityEnum> list = Lists.newArrayList();
		for(CityEnum location : getAll()){
			if(location.provinceCode == provinceCode){
				list.add(location);
			}
		}
		return list;
	}
	
	public static CityEnum getByCode(int code){
		for(CityEnum location : getAll()){
			if(location.code == code){
				return location;
			}
		}
		return null;
	}
	
	public static CityEnum getByName(String name){
		for(CityEnum location : getAll()){
			if(location.name.equals(name)){
				return location;
			}
		}
		return null;
	}
}
